Revit 2027 API
CableType.GetCableTypeIds Method
 Gets all the Cable Types in the given document, sorted by name.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetCableTypeIds(
	Document document
)
Public Shared Function GetCableTypeIds (
	document As Document
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetCableTypeIds(
	Document^ document
)
static member GetCableTypeIds :
        document : Document -> IList<ElementId>
Parameters
document Document
 The document.
Return Value
IList<ElementId>
 All the Cable Type ids in this document.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
See Also
Reference
CableType Class
Autodesk.Revit.DB.Electrical Namespace